<?php

use yii\db\Migration;

class m160921_214658_properties extends Migration
{
    public function safeUp()
    {
        $propertyType = [
            ['Boolean', null],
            ['Int', null],
            ['Bigint', null],
            ['Float', null],
            ['String', null],
            ['Text', null],
            ['Date', null],
            ['Timestamp', null],
            ['Geolocation', null],
            ['ListItem', null],
            ['Image', 3],
        ];
        $this->batchInsert('property_type', ['name', 'parent_id'], $propertyType);

        $propertyUnit = [
            ['кг/м3'],
            ['См/м'],
            ['Вт/(м*К)'],
            ['Дж/(кг*К)'],
            ['К'],
        ];
        $this->batchInsert('property_unit', ['name'], $propertyUnit);

        $property = [
            ['Агрегатное состояние (при нормальный условиях)', 10, null],
            ['Плотность', 4, 1],
            ['Экологичность', 1, null],
            ['Удельная Электропроводность', 4, 2],
            ['Коэффициент теплопроводности', 4, 3],
            ['Удельная теплоёмкость', 4, 4],
            ['Температура плавления', 4, 5],
            ['Температура кипения', 4, 5],
            ['Сублимация/возгонка', 1, null],
            ['Реакция на нагрузки', 10, null],
            ['Цвет', 10, null],
            ['Структура', 10, null],
            ['Твёрдость', 1, null],
            ['Гигроскопичность-влагоотдача', 1, null],
            ['Огнеупорность', 10, null],
            ['Временная конструкция', 1, null],
            ['Тип конструкции', 10, null],
            ['Динамика соединения', 10, null],
            ['Вид соединения', 10, null],
            ['Требует герметичности', 1, null],
            ['Тип соединения', 10, null],
            ['Потребляемая энергия', 10, null],
        ];
        $this->batchInsert('property', ['name', 'property_type_id', 'property_unit_id'], $property);

        $listItemPropertyValue = [
            ['1', '1', 'Твёрдое'],
            ['1', '2', 'Жидкое'],
            ['1', '3', 'Газообразное'],
            ['10', '1', 'Упругость'],
            ['10', '2', 'Пластичность'],
            ['10', '3', 'Хрупкость'],
            ['12', '1', 'Плотная однородная'],
            ['12', '2', 'Ячеистая'],
            ['12', '3', 'Волокнистая, слоистая'],
            ['12', '4', 'Зернистость'],
            ['15', '1', 'Огнеупорные'],
            ['15', '2', 'Тугоплавкие'],
            ['15', '3', 'Легкоплавкие'],
            ['17', '1', 'Монолитная'],
            ['17', '2', 'Сборная'],
            ['17', '3', 'Каркасная'],
            ['17', '4', 'Блочная'],
            ['18', '1', 'Статичное'],
            ['18', '2', 'Подвижное'],
            ['19', '1', 'Опора'],
            ['19', '2', 'Монолитное'],
            ['19', '3', 'Химическое'],
            ['19', '4', 'Проникновение'],
            ['19', '5', 'Схватывающее'],
            ['21', '1', 'Разъемное'],
            ['21', '2', 'Неразъемное'],
            ['22', '3', 'Ручной'],
            ['22', '4', 'Топливный'],
            ['22', '5', 'Электрический'],
        ];
        $this->batchInsert('list_item_property_value', ['property_id', 'value', 'label'], $listItemPropertyValue);
    }

    public function safeDown()
    {
    }
}
